tap "adb-over-wifi/git-open"
tap "bridgecrewio/tap"
tap "buo/cask-upgrade"
tap "codecrafters-io/tap"
tap "confluentinc/tap"
tap "devops-rob/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "minamijoyo/hcledit"
brew "xz"
brew "arm-none-eabi-gcc"
brew "mpdecimal"
brew "openssl@3"
brew "arm-none-eabi-gdb"
brew "awk"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "cfssl"
brew "checkov"
brew "d2"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker-machine"
brew "etcd"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "git-open"
brew "git-recent"
brew "gnupg"
brew "go"
brew "gperftools"
brew "graphviz"
brew "hadolint"
brew "hexyl"
brew "htop"
brew "infracost"
brew "inframap"
brew "ipcalc"
brew "iproute2mac"
brew "jq"
brew "node"
brew "pandoc"
brew "jupyterlab"
brew "openjdk"
brew "kafka"
brew "kind"
brew "kubernetes-cli"
brew "libpcap"
brew "lima"
brew "llvm"
brew "maven"
brew "minikube"
brew "mysql"
brew "mysql@8.4"
brew "pipx"
brew "pkgconf"
brew "postgresql@14"
brew "pre-commit"
brew "pyenv"
brew "pyenv-pip-migrate"
brew "ripgrep"
brew "semgrep"
brew "shellcheck"
brew "shfmt"
brew "suricata"
brew "tailscale"
brew "tcl-tk"
brew "terraform-docs"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "tldr"
brew "tmux"
brew "tree"
brew "trivy"
brew "typescript"
brew "vite"
brew "wget"
brew "wireshark"
brew "yamllint"
brew "yq"
brew "bridgecrewio/tap/yor"
brew "codecrafters-io/tap/codecrafters"
brew "confluentinc/tap/cli"
brew "devops-rob/tap/target"
brew "hashicorp/tap/vault"
brew "minamijoyo/hcledit/hcledit"
cask "anki"
cask "arc"
cask "chatgpt"
cask "cloudflare-warp"
cask "discord"
cask "docker"
cask "drawio"
cask "font-goldman"
cask "google-chrome"
cask "iterm2"
cask "logitech-options"
cask "microsoft-auto-update"
cask "monitorcontrol"
cask "mysqlworkbench"
cask "notion"
cask "numi"
cask "obsidian"
cask "sentinel"
cask "slack"
cask "telegram"
cask "trunk-io"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wechat"
cask "whatsapp"
cask "wireshark-chmodbpf"
cask "zoom"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.markdown-mermaid"
vscode "bradgashler.htmltagwrap"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "electreefrying.auto-import"
vscode "electreefrying.drag-import-relative-path"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "geecode.geecode-python"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gurumukhi.selected-lines-count"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "huangbaoshan.comment-aligner"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mkornelsen.vscode-arm64"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "mwpb.java-prettier-formatter"
vscode "nextchaptersoftware.unblocked-vscode"
vscode "oracle.oracle-java"
vscode "orangeinfusion.dotenv-plus-json"
vscode "orta.vscode-jest"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "peakchen90.open-html-in-browser"
vscode "pkief.material-icon-theme"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sburg.vscode-javascript-booster"
vscode "seudev.vscode-java-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
vscode "trunk.io"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "xabikos.javascriptsnippets"
